Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.EnterPositiveValueLessThan Property
 Please enter a positive value less than [Value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EnterPositiveValueLessThan { get; }
Public Shared ReadOnly Property EnterPositiveValueLessThan As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EnterPositiveValueLessThan {
	FailureDefinitionId^ get ();
}
static member EnterPositiveValueLessThan : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace